app/controllers/admin/base_controller.rb

  def index
    @last_orders = Cart.latest(10)
---
SELECT "carts".* FROM "carts" ORDER BY "carts"."created_at" DESC LIMIT 10