app/controllers/admin/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "name" = ?, "desc" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["name", "Vanilla Chai - Retail "], ["desc", "6  x 16oz tins"], ["updated_at", Mon, 28 Apr 2014 16:15:30 UTC +00:00]]
---
  def update
      @product = Product.find(params[:id])

      respond_to do |format|
        if @product.update_attributes(params[:product])

INSERT INTO `products` (`created_at`, `desc`, `name`, `price_cents`, `sku`, `updated_at`) VALUES ('2014-05-04 17:47:36', '6 x 16 oz cans', 'Vanilla Chai - Retail ', 2300, '4CD2300', '2014-05-04 17:47:36')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save