app/controllers/admin/storegroups_controller.rb

SELECT `storegroups`.* FROM `storegroups` WHERE `storegroups`.`id` = 1 LIMIT 1
---
  def edit
    @storegroup = Storegroup.find(params[:id])

SELECT `storegroups`.* FROM `storegroups` WHERE `storegroups`.`id` = 1 LIMIT 1
UPDATE `storegroups` SET `name` = '001-012', `area` = 'WA/AK', `updated_at` = '2014-06-24 15:05:09' WHERE `storegroups`.`id` = 1
---
  def update
      @storegroup = Storegroup.find(params[:id])

      respond_to do |format|
        if @storegroup.update_attributes(params[:storegroup])

INSERT INTO `storegroups` (`area`, `created_at`, `name`, `updated_at`) VALUES ('OR/MTN', '2014-06-24 15:35:45', '020-073', '2014-06-24 15:35:45')
---
  def create
    @storegroup = Storegroup.new(params[:storegroup])

    respond_to do |format|
      if @storegroup.save