app/controllers/admin/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`address`, `created_at`, `email`, `encrypted_password`, `fulfillment`, `slug`, `store`, `updated_at`, `username`) VALUES ('no address', '2014-06-24 13:39:57', 'test@test.de', '$2a$10$Au8bUjkL4VdZueepzxYqwuegnrw53hivJcrY2DLtq5wyd1oAdsvWm', 1, 'fulfillment', 'no store', '2014-06-24 13:39:57', 'fulfillment')

  def update
    old_username = @user.username
    new_params = user_params.dup
    new_params[:username] = new_params[:username].strip
    new_params[:email] = new_params[:email].strip

    @user.username = new_params[:username]
    @user.address = new_params[:address]
    @user.store = new_params[:store]
    @user.email = new_params[:email]
    @user.storegroup_id = new_params[:storegroup_id]
    @user.password = new_params[:password] if new_params[:password].strip.length > 0
    @user.password_confirmation = new_params[:password_confirmation] if new_params[:password_confirmation].strip.length > 0

    if current_user.id != @user.id
      @user.admin = new_params[:admin]=="0" ? false : true
      @user.locked = new_params[:locked]=="0" ? false : true
    end

    if @user.valid?
      @user.save
---
UPDATE "users" SET "address" = ?, "store" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["address", "no address"], ["store", "admin store"], ["updated_at", Mon, 28 Apr 2014 12:31:31 UTC +00:00]]

  def set_user
    @user = User.friendly.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1