app/controllers/fulfillment/carts_controller.rb

  def show
    @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE (user_id = 2 AND created_at >= '2014-05-16 00:00:00' AND created_at <= '2014-05-16 23:59:59')

  def mark_as_processing
    @cart = Cart.find(params[:id])
    @cart.update_attribute :status, Cart::STATE_PROCESSING
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "50"]]
UPDATE "carts" SET "status" = ?, "updated_at" = ? WHERE "carts"."id" = 50  [["status", 1], ["updated_at", Wed, 30 Apr 2014 13:49:34 UTC +00:00]]

  def revert
    @cart = Cart.find(params[:id])
    @cart.update_attribute :status, Cart::STATE_OPEN
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "29"]]
UPDATE "carts" SET "status" = ?, "updated_at" = ? WHERE "carts"."id" = 29  [["status", 0], ["updated_at", Wed, 30 Apr 2014 13:53:11 UTC +00:00]]

  def mark_as_fulfilled
    @cart = Cart.find(params[:id])
    @cart.update_attribute :status, Cart::STATE_FULFILLED
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "50"]]
UPDATE "carts" SET "status" = ?, "updated_at" = ? WHERE "carts"."id" = 50  [["status", 2], ["updated_at", Wed, 30 Apr 2014 13:54:43 UTC +00:00]]