app/views/admin/base/index.html.erb

SELECT COUNT(*) FROM `storegroups`
---
    <h3>Menu</h3>
	<h4><%= link_to "Store groups", admin_storegroups_path %> <small>- <%="#{Storegroup.count} store groups"%></small></h4>