app/views/admin/base/index.html.erb

    <h3>Menu</h3>
    <h4><%= link_to "Users", admin_users_path %> <small>- <%= "#{User.count} users" %></small></h4>
	<h4><%= link_to "Products", admin_products_path %> <small>- <%= Product.count%> products</small></h4>
---
SELECT COUNT(*) FROM "users" WHERE (admin = 'f' AND locked = 'f')
SELECT COUNT(*) FROM `products`

  <div class="col-sm-4">
    <h3>Last Orders <small>- <%= "#{Cart.today.count } today"%></small></h3>
---
SELECT "carts".* FROM "carts" ORDER BY "carts"."created_at" DESC LIMIT 10
SELECT COUNT(*) AS count_all, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(`created_at`, INTERVAL 0 HOUR), '+00:00', 'Etc/UTC'), '%Y-%m-%d 00:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 HOUR) AS day FROM `carts` WHERE (`created_at` >= '2014-04-16 00:00:00' AND `created_at` <= '2014-05-16 16:06:56') GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(`created_at`, INTERVAL 0 HOUR), '+00:00', 'Etc/UTC'), '%Y-%m-%d 00:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 HOUR)