app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(params[:cart])
    @cart.user = current_user
    p @cart
    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", Mon, 28 Apr 2014 10:25:07 UTC +00:00], ["updated_at", Mon, 28 Apr 2014 10:25:07 UTC +00:00], ["user_id", 1]]

  def confirm
    @cart = Cart.find(params[:id])
    if params[:cart][:confirmed] == "1"
      @cart.update_attribute :confirmed, true
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "29"]]
UPDATE "carts" SET "confirmed" = ?, "updated_at" = ? WHERE "carts"."id" = 29  [["confirmed", true], ["updated_at", Mon, 28 Apr 2014 12:02:51 UTC +00:00]]