app/controllers/pages_controller.rb

SELECT COUNT(*) FROM `products`
---
  def store
    @cart = Cart.new
    p Product.products_for_sale.count