app/views/admin/users/edit.html.erb

SELECT `storegroups`.* FROM `storegroups`
---
        <div class="col-sm-6">
          <%= f.select :storegroup_id, options_from_collection_for_select(Storegroup.all, 'id', 'name', @user.storegroup_id), :prompt => "Select one" %>