app/views/admin/users/new.html.erb

SELECT `storegroups`.* FROM `storegroups` ORDER BY `storegroups`.`id` ASC LIMIT 1
---
        <div class="col-sm-6">
          <%= f.select :storegroup_id, options_from_collection_for_select(Storegroup.all, 'id', 'name') %>